app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.all.order(:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completed") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", ""], ["description", ""], ["created_at", "2018-09-24 04:22:55.337340"], ["updated_at", "2018-09-24 04:22:55.337340"], ["completed", false]]
---
  def create
    filtered_task_params = task_params()
    @task = Task.new(filtered_task_params)
    @task.completed = false
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Water the grass and all potted plants indoor and outdoor"], ["updated_at", "2018-09-22 22:58:44.668329"], ["id", 1]]
---
    task = Task.find_by(id: params[:id])

    filtered_task_params = task_params()

    if task.update(filtered_task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def destroy
    @task = Task.find_by(id: params[:id])
    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-24 01:19:23.804145"], ["id", 15]]
UPDATE "tasks" SET "updated_at" = $1, "completed_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-24 01:41:50.231961"], ["completed_date", "2018-09-23"], ["id", 14]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", false], ["updated_at", "2018-09-24 01:42:18.946834"], ["id", 14]]
UPDATE "tasks" SET "updated_at" = $1, "completed_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-24 01:42:18.956025"], ["completed_date", nil], ["id", 14]]
---
  def complete
    @task = Task.find(params[:id])
    if @task.completed == false
      @task.update(completed: true)
      @task.update(completed_date: Date.today)
    elsif @task.completed == true
      @task.update(completed: false)
      @task.update(completed_date: nil)